---
kind: method
id: M:Autodesk.Revit.DB.ElementIntersectsElementFilter.GetElement
source: html/90610610-97aa-f61f-8c85-4eec449d0035.htm
---
# Autodesk.Revit.DB.ElementIntersectsElementFilter.GetElement Method

Gets the target element.

## Syntax (C#)
```csharp
public Element GetElement()
```

## Returns
The element.